"use client"
import { useState } from "react"

export function Description() {
    const [isOpen, setIsOpen] = useState<boolean>(false)

    return <section className="m-4 max-w-270 transition-transform duration-3000 ease-in-out lg:m-5">
        <p className="">
            Конвертер единиц измерения онлайн: быстрый и точный расчёт всех величин
            Добро пожаловать в современный онлайн-конвертер, который станет вашим незаменимым помощником в работе с различными единицами измерения. Наш многофункциональный сервис позволяет мгновенно конвертировать валюты, переводить значения длины, объёма и веса между разными системами измерения.
        </p>
        <div className={`transition-all duration-500 ease-in-out overflow-hidden ${isOpen ? 'max-h-96 opacity-100' : 'max-h-0 opacity-0'}`}>
            <p>
                Конвертация валют осуществляется по актуальным курсам всех популярных денежных единиц мира: доллар США, евро, британский фунт, российский рубль, японская иена и множество других валют. Вы сможете легко рассчитать стоимость товаров и услуг в разных валютах, спланировать бюджет путешествия или провести финансовые операции.
                Перевод единиц длины поддерживает все распространённые метрические и имперские системы: метры, сантиметры, миллиметры, километры, футы, дюймы, мили и морские мили. Это особенно удобно для строителей, проектировщиков и всех, кто работает с измерениями.
                Расчёт объёма производится в различных единицах измерения: литры, кубические метры, галлоны, баррели, пинты, кубические футы. Наш конвертер объёма пригодится при работе с жидкостями, газами и твёрдыми материалами.
                Перевод веса осуществляется между килограммами, граммами, тоннами, фунтами, унциями и другими единицами массы. Сервис поможет вам быстро конвертировать значения веса при готовке, торговле или логистических расчётах.
                Наш конвертер отличается высокой точностью расчётов, интуитивно понятным интерфейсом и мгновенной обработкой данных. Никаких регистраций и установки дополнительного ПО — просто откройте сайт и начните пользоваться.
                Используйте наш универсальный конвертер для решения повседневных задач, профессиональных расчётов или образовательных целей. Мы регулярно обновляем курсы валют и коэффициенты конвертации, чтобы вы всегда получали актуальные результаты.
                Начните пользоваться конвертером прямо сейчас и оцените все преимущества быстрого и точного перевода единиц измерения!
            </p>
        </div>
        <span onClick={() => setIsOpen(!isOpen)} className='text-green-700'>{isOpen ? 'Скрыть' : 'Развернуть'}</span>

    </section>
}
